[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",

    "category_id": "01",

    "title": "Build Responsive Real-World Websites with HTML and CSS",
    "price": "100$",
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://www.filepicker.io/api/file/eYA6E8L3TiGl0GxpQoS6",
    "details": "Learn modern HTML5, CSS3 and web design by building a stunning website for your portfolio! Includes flexbox and CSS Grid. Having gone through other related courses on other platforms, I can say this course is the most practical and readily applicable course on web design and development I have taken. Well, I'm here to teach you HTML, CSS, and web design, all by building the stunning website that you just saw, step-by-step. So, after finishing this course, you will know exactly how to build a beautiful, professional, and ready-to-launch website just like Omnifood, by following a 7-step process. And it will even look great on any computer, tablet, and smartphone.  But what if you want to build a completely different website? Well, no problem! I designed the course curriculum with exactly this goal: to enable you to design and build any website that you can think of, not just copy the course project."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",

    "category_id": "02",

    "title": "The Complete JavaScript Course 2022: From Zero to Expert!",
    "price": "150$",
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://miro.medium.com/max/720/1*YQgaKfVzK-YpxyT3NYqJAg.png",
    "details": "The modern JavaScript course for everyone! Master JavaScript with projects, challenges and theory. Many courses in one!. Really, really well made course. Super in-depth, with great challenges and projects that will solidify your Javascript understanding. I found the lectures were paced perfectly -- Jonas doesn't skip over anything that might be useful to a JS developer — Carson Bartholomew. JavaScript is the most popular programming language in the world. It powers the entire modern web. It provides millions of high-paying jobs all over the world. That's why you want to learn JavaScript too. And you came to the right place!"
  },

  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6c",

    "category_id": "03",

    "title": "Complete Web & Mobile Designer in 2022: UI/UX, Figma, +more",
    "price": "200$",
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://aufaitux.com/wp-content/uploads/2020/05/UIUX-designing-1.jpg",
    "details": "Become a Designer in 2022! Master Mobile and Web Design, User Interface + User Experience (UI/UX Design), HTML, and CSS. Just updated with all modern Design tools and best practices for 2022! Join a live online community of over 600,000+ students and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto for top companies. A great Designer is becoming harder and harder to find and it isn't rare to find designers make $160,000+ salaries now because it is such a valuable skill. We will teach you how to get there!. Using the latest best practices in Web Design and Mobile Design as well as User Interface and User Experience Design (UI/UX), this course focuses on efficiently getting you from zero to a point where you can get hired or win freelance contracts. We will use in demand tools like Figma to show you a full workflow from start to finish. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies. The course also includes 100+ assets and premium design templates that you can keep and use to customize for all your future projects. We guarantee you this is the most comprehensive online resource on Design skills! The curriculum is going to be very hands on as we walk you from start to finish of working as a Designer, all the way into learning how to create final professional designs and then converting them into actual websites or apps using HTML and CSS. "
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6d",

    "category_id": "04",

    "title": "React - The Complete Guide (incl Hooks, React Router, Redux)",
    "price": "120$",
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://www.scnsoft.com/blog-pictures/cover-pics/react_js.png",
    "details": "Dive in and learn React.js from scratch! Learn Reactjs, Hooks, Redux, React Routing, Animations, Next.js and way more! This course is fully up-to-date with React 18 (the latest version of React)! It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know! This course also comes with two paths which you can take: The complete path (full >40h course) and the summary path (~4h summary module) - you can choose the path that best fits your time requirements! :-) React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well. You'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! :) And in case you don't even know why you would want to learn React and you're just here because of some ad or the algorithm - no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important!"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6e",

    "category_id": "05",

    "title": "Master Bootstrap 5 with 6 projects and Sass customization",
    "price": "90$",
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://itechzo.com/wp-content/uploads/2019/11/bootstrap.png",
    "details": "Master all parts of Bootstrap 5 and customization with Sass using Learning Kit, coding exercises, quizzes and much more. Bootstrap - the world's most popular front-end frameworks! This course covers all the different parts of the latest version of the world's most popular front-end framework, Bootstrap 5.1.1 from September 7, 2021. Bootstrap has been used on millions of websites around the world and have been carefully developed to cover a wide range of typical user interfaces. Web pages built with Bootstrap 5 works across all kinds of devices, browsers and screen sizes while also taking care of accessibility and a clean and modern design. This course is for the beginner who want to learn Bootstrap 5 from the bottom up. It goes through all the different parts, but each lecture can be watched independently. After learning about all the different parts you will learn how to customize and extend Bootstrap 5 with Sass. First of all, I will show you how to compile Sass with the Koala app and introduce you to the Bootstrap 5 Sass files. Then I will show you many examples of how you can customize and extend Bootstrap 5 by changing global options as well as changing the settings and styles for color, layout, content, forms, components, helpers and utilities.Finally, I will walk you through how to create 6 different projects using Bootstrap 5."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6f",

    "category_id": "06",

    "title": "Tailwind CSS From Scratch | Learn By Building Projects",
    "price": "80$",
    "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
    "image_url": "https://nystudio107-ems2qegf7x6qiqq.netdna-ssl.com/img/blog/_1200x630_crop_center-center_82_none/speeding-up-tailwind-css-builds2.png?mtime=1602603359",
    "details": "Build great looking layouts fast and efficiently using Tailwind CSS utility classes.This is a fun project-based course to learn how to create awesome layouts using the Tailwind CSS framework and get comfortable using utility classes over something like Bootstrap, which uses component-based classes. Let's take a look at the outline for this course.I don't want to jump right into the projects, though you certainly could if you want. So the first two sections, we will be working in a coding sandbox. In every new video in these sections, we will have a new file to experiment with and learn all about a certain aspect of Tailwind. For example, we will have pages/videos for colors, typography, spacing, flex classes, and much more. This allows us to essential touch on all parts of Tailwind in a specific order, rather than just jumping right into projects.Next, we will take what we learn in the sandbox environment and use it to create some small projects. These are things that will take 10 - 20 minutes to create and we will do it all in one video per project. The mini-projects include.Email Subscribe Card,Pricing Grids,Product Modal,Image Gallery,Login Modal.I may even add more mini-projects later. These will help you get your feet wet by creating something."
  }
]
